app/views/dishes/show.html.erb

SELECT "restaurants".* FROM "restaurants" INNER JOIN "dishes_restaurants" ON "restaurants"."id" = "dishes_restaurants"."restaurant_id" WHERE "dishes_restaurants"."dish_id" = $1  [["dish_id", 44]]
---
</p>
<% @dish.restaurants.each do |restaurant| %>