app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
---
  def index
    @dishes = Dish.all

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @dish = Dish.find params[:id]

INSERT INTO "dishes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "khf.llllll"], ["created_at", "2018-07-18 02:11:02.239560"], ["updated_at", "2018-07-18 02:11:02.239560"]]
---
  def create
    dish = Dish.create dish_params

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
  def edit
    @dish = Dish.find params[:id]

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "dishes" SET "image" = $1, "updated_at" = $2 WHERE "dishes"."id" = $3  [["image", "https://i.imgur.com/A1KIlmw.jpg"], ["updated_at", "2018-08-27 04:27:26.173839"], ["id", 40]]
---
  def update
    dish = Dish.find params[:id]
    dish.update dish_params