app/controllers/nationalities_controller.rb

  def index
    @nationalities = Nationality.all
---
SELECT "nationalities".* FROM "nationalities"

  def show
    @nationality = Nationality.find params[:id]
---
SELECT  "nationalities".* FROM "nationalities" WHERE "nationalities"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]

  def create
    nationality = Nationality.create nationality_params
---
INSERT INTO "nationalities" ("name", "food_history", "famous_food", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dgfgdgg"], ["food_history", ""], ["famous_food", "fghlllll"], ["created_at", "2018-07-18 02:43:46.081875"], ["updated_at", "2018-07-18 02:43:46.081875"]]

  def edit
    @nationality = Nationality.find params[:id]
---
SELECT  "nationalities".* FROM "nationalities" WHERE "nationalities"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

  def update
    nationality = Nationality.find params[:id]
    nationality.update nationality_params
---
SELECT  "nationalities".* FROM "nationalities" WHERE "nationalities"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "nationalities" SET "food_history" = $1, "updated_at" = $2 WHERE "nationalities"."id" = $3