app/views/categories/show.html.erb

SELECT "restaurants".* FROM "restaurants" INNER JOIN "dishes_restaurants" ON "restaurants"."id" = "dishes_restaurants"."restaurant_id" INNER JOIN "dishes" ON "dishes_restaurants"."dish_id" = "dishes"."id" WHERE "dishes"."category_id" = $1  [["category_id", 31]]
---
    <p class = "stext">Restaurants:</p>
  <% @category.restaurants.each do |restaurant| %>