app/views/nationalities/show.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."nationality_id" = $1  [["nationality_id", 32]]
---
  <p class = "stext"> Restaurants:</p>
<% @nationality.restaurants.each do |restaurant| %>